{
    "job_title": "Software Engineer III",
    "company_name": "Walmart",
    "job_description_text": "About the job\r\nPosition Summary...\r\n\r\nWhat you'll do...\r\n\r\nJob Description\r\n\r\nWe are seeking a talented and passionate Software Engineer III to join our team. The ideal candidate will have experience working in a large project environment, possessing solid technical leadership abilities along with a strong development background in Java and frontend technologies. You will collaborate with our product team, architects, and quality assurance personnel, taking the lead in designing, developing, and enhancing resilient and easy-to-maintain applications.\r\n\r\nWhat you'll do:\r\n\r\nCollaborate with our product team, architects, and quality assurance to provide team leadership and design, develop, and enhance a reliable and easy-to-maintain infrastructure. \r\nPartner and collaborate on product development with business stakeholders and cross-functional teams to ensure compliance with Walmart code of conduct. \r\nTroubleshoot business and production issues by gathering information (for example, issue, impact, criticality, and possible root cause) and engage support teams to assist in the resolution of issues. \r\nPerform root cause analysis to prevent future occurrence of issues and ensure compliance with Walmart code of conduct. \r\nProvide technical guidance and continuous mentorship to junior members in the team to ensure compliance with Walmart code of conduct. \r\n\r\nWhat you'll bring:\r\n\r\nOver +3 years of professional experience as a hands-on Fullstack Developer\r\nExpert in developing Web Applications with React and related technologies\r\nKnowledge and practical experience with Storybook component library for efficient UI development and documentation. \r\nProficient in JavaScript, React, Next.js, and TypeScript\r\nExperience in styling frameworks, including SCSS and CSS, for responsive design\r\nSkilled in unit testing with Jest and integration\/end-to-end testing with Cypress\r\nExperience designing and implementing highly available backend micro services using Java programming languages. \r\nExperience utilizing one of the following NoSQL databases: CosmosDB or MongoDB. \r\nExperience working with container orchestration frameworks including Kubernetes. \r\nExperience with continuous integration and continuous deployment strategies to improve reliability. \r\nExperience with telemetry and observability frameworks including Prometheus, Grafana, and ELK. \r\nExperience with unit and performance testing of applications to increase resilience using technologies including Jenkins, Junit, and JMeter. \r\nExperience working in message queue Kafka to send data between asynchronous services.",
    "resume_id": "80539456-76fa-48ac-b902-a19708f57aa0",
    "job_url": "https://example.com/"
}