{
    "job_title": "Machine Learning Engineer",
    "company_name": "TikTok",
    "job_description_text": "About the job\r\nResponsibilities\r\n\r\nAbout the team\r\n\r\nWe are a group of applied machine learning engineers and data scientists that focus on general recommendations and\/or search. We are developing innovative algorithms and techniques to improve user engagement and satisfaction, converting creative ideas into business-impacting solutions. We are interested and excited in applying large scale machine learning to solve various real-world problems.\r\n\r\nResponsibilities:\r\n\r\n Participate in building large-scale (10 million to 100 million) recommendation or Search algorithms and systems.\r\n Build long and short term user interest models, analyze and extract relevant information from large amounts of various data and design algorithms to explore users' latent interests efficiently.\r\n Design, develop, evaluate and iterate on predictive models for candidate generation and ranking(eg. Click Through Rate and Conversion Rate prediction) , including, but not limited to building real-time data pipelines, feature engineering, model optimization and innovation.\r\n Design and build supporting\/debugging tools as needed.\r\n\r\nIn order to enhance collaboration and cross-functional partnerships, among other things, at this time, our organization follows a hybrid work schedule that requires employees to work in the office 3 days a week, or as directed by their manager\/department. We regularly review our hybrid work model, and the specific requirements may change at any time.\r\n\r\nQualifications\r\n\r\nMinimum Qualitifications:\r\n\r\n Master's degree or higher in Computer Science or related fields.\r\n Strong programming and problem-solving ability.\r\n This role is open to PhD New Grads or MS Grads with 1-3 years of experience in applied machine learning, familiar with one or more of the algorithms such as Collaborative Filtering, Matrix Factorization, Factorization Machines, Word2vec, Logistic Regression, Gradient Boosting Trees, Deep Neural Networks, Wide and Deep etc.\r\n Experience in Deep Learning Tools such as tensorflow\/pytorch.\r\n Experience with at least one programming language like C++\/Python or equivalent.\r\n\r\nPreferred Qualifications:\r\n\r\n Experience in recommendation system, online advertising, information retrieval, natural language processing, machine learning, large-scale data mining, or related fields.\r\n Publications at KDD, NeurlPS, WWW, SIGIR, WSDM, ICML, IJCAI, AAAI, RECSYS and related conferences\/journals, or experience in data mining\/machine learning competitions such as Kaggle\/KDD-cup etc.",
    "job_url": "https://example.com/"
}