{
    "job_title": "Lead Software Engineer, Full Stack",
    "company_name": "Capital One",
    "job_description_text": "About the job\r\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Full Stack Software Engineers who are passionate about marrying data with emerging technologies. As a Capital One Lead Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\r\n\r\nWhat You’ll Do:\r\n\r\nLead a portfolio of diverse technology projects and a team of developers with deep experience in distributed microservices, and full stack systems to create solutions that help meet regulatory needs for the company\r\nShare your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\r\nCollaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\r\nUtilize programming languages like JavaScript, Java, HTML\/CSS, TypeScript, SQL, Python, and Go, Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services \r\n\r\nBasic Qualifications:\r\n\r\nBachelor’s Degree\r\nAt least 4 years of experience in software engineering (Internship experience does not apply)\r\nAt least 1 year experience with cloud computing (AWS, Microsoft Azure, Google Cloud)\r\n\r\nPreferred Qualifications:\r\n\r\nMaster's Degree\r\n7+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\r\n3+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\r\n4+ years of experience in open source frameworks\r\n1+ years of people management experience\r\n2+ years of experience in Agile practices\r\n",
    "job_url": "https://example.com/"
}