{
    "job_title": "Software Development Engineer",
    "company_name": "Amazon",
    "job_description_text": "About the job - Description\n\nAre you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you’ll fit right in here at Amazon Robotics. We are a smart team of doers who work passionately to apply cutting edge advances in robotics and software to solve real-world challenges that will transform our customers’ experiences. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling, and fun.\n\nAmazon Robotics empowers a smarter, faster, more consistent customer experience through automation. Amazon Robotics automates fulfillment center operations using various methods of robotic technology including autonomous mobile robots, sophisticated control software, language perception, power management, computer vision, depth sensing, machine learning, object recognition, and semantic understanding of commands. Amazon Robotics has a dedicated focus on research and development to continuously explore new opportunities to extend its product lines into new areas.\n\nAmazon Robotics' full-time opportunity will be based out of the Greater Boston Area or the Greater Seattle Area. Both campuses provide a unique opportunity to have direct access to robotics testing labs and manufacturing facilities.\n\nA day in the life\n\nAs a Software Engineer, You Will\n\n Identify and develop software solutions to current business problems\n Work with your manager and team to create milestones and deliverables\n Participate in daily scrums and reviews with development teams\n Develop documentation and lead reviews with other engineers\n Write code and unit tests and integrate code with other software and hardware components\n Prototype and test concepts or features, both through simulation tools and emulators and with live robotic equipment\n Work directly with customers to test software prototypes and incorporate feedback\n Utilize Amazon Robotics and Amazon engineering tools, processes and technologies\n\nBasic Qualifications\n\n Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design\n Bachelor's degree in computer science related fields OR 1+ years equivalent experience in software development\n Graduation date is before June 2025\n\nPreferred Qualifications\n\n Experience building software applications through internships, course projects, hackathons or personal projects\n Proficient oral and written communication skills\n Ability to collaborate effectively with a diverse, talented team\n Experience with creative problem solving and articulating technical challenges and solutions\n Exposure to any of the following concepts: AWS and other Web Technologies, schedulers, workflows, state machines, multi-threading, and networking protocols\n Interest in Robotics including coursework or clubs",
    "job_url": "https://example.com/"
}