{
    "job_title": "Software Engineer II - Infrastructure",
    "company_name": "Microsoft",
    "job_description_text": "About the job\r\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\r\n\r\nWithin Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.\r\n\r\nWe are looking for a Software Engineer II to join our team.\r\n\r\nThis work focuses on cluster orchestration, usually a part of the “control plane” of cloud systems, and, is related to SQL DB’s tight integration with Microsoft’s Service Fabric (aka Windows Fabric) cloud orchestrator (the same class of system as Kubernetes). The problem at hand is broadly a distributed systems problem, with an eye towards designing and building a solution that will stand the test of time (think decade). The complexity of the component interaction graph and dependencies that are taken on the PLB component are substantial but justified due its mission critical nature.\r\n\r\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\r\n\r\nResponsibilities\r\n\r\nOwn project efforts, be end-to-end accountable for a global cloud delivery.\r\nWork on a distributed system that manages cluster resources and maintains availability\/reliability.\r\nWork on multiple layers of a public cloud system's resource governance from the node level, to the geo-region level.\r\nWork with multiple component stakeholders as well as multiple product teams to achieve goals.\r\nSupport customers.\r\nEmbody our culture and values\r\n\r\nQualifications\r\n\r\nRequired Qualifications\r\n\r\nBachelor's degree in computer science, or related technical discipline AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\r\nOR equivalent experience.\r\n2+ years of experience with distributed systems or database systems or System Services\r\nOther Requirements\r\n\r\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\r\n\r\nThis position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\r\n\r\nPreferred Qualifications\r\n\r\nExperience in Cloud service offering\r\nExperience with at-scale distributed systems, or data analytics \/ systems at the TB+ scale",
    "job_url": "https://example.com/"
}